// Бакуменко С.В. Задача от 26.04.2023 14:07:09 

//      процедуры меняют представление поля наименование контакного лица в зависимости
//      от заполненности реквизита "Действует на основании" 

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	Если НЕ ПустаяСтрока(Данные.БС_ДействуетНаОсновании) Тогда
		
		Представление = Данные.Наименование+ "(на осн." + НРег(Данные.БС_ДействуетНаОсновании) + ")"; 
		
	Иначе
		
		Представление = Данные.Наименование;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("БС_ДействуетНаОсновании");
	
	Поля.Добавить("Наименование");  
	
КонецПроцедуры

