&НаКлиенте
Процедура ПриИзмененииСогласованнаяСкидка(Форма) Экспорт 
	
	//    Проверка условия заполненности табличной части и открытой страницы таблицы
	Если Форма.Элементы.Страницы.ТекущаяСтраница.Заголовок = "Товары"  И Форма.Объект.Товары.Количество() > 0 Тогда 
		
		ДиалогНаРасчетСкидки(Форма);// обращение к процедуре вызова диалога 
		
	КонецЕсли;
	
	Если Форма.Элементы.Страницы.ТекущаяСтраница.Заголовок = "Услуги" И Форма.Объект.Услуги.Количество() > 0 Тогда 
		
		ДиалогНаРасчетСкидки(Форма);// обращение к процедуре вызова диалога 
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура ДиалогНаРасчетСкидки(Форма)
	
	Обещание = ВопросАсинх("Изменен процент скидки. Пересчитать табличную часть?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
	Результат = Ждать обещание; // тут выполнение остановится пока пользователь не ответит на вопрос
	
	Если Результат = КодВозвратаДиалога.Да Тогда  // если выбрали "ДА"
		
		ПересчетТаблиц(Форма);
		
	Иначе
		
		Возврат;// если выбрали "НЕТ"
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПересчетТаблиц(Форма) Экспорт // расчет скидки для всех элементов в табличной части 
	
	Сч = 0;
	
	Объект = Форма.Объект;
	
	Пока Сч < Объект.Товары.Количество() Цикл  // для страницы ТОВАРЫ
		
		ОбщаяСуммаСкидкиТовары = Объект.Товары[Сч].Скидка + Объект.БС_СогласованнаяСкидка;
		
		Если ОбщаяСуммаСкидкиТовары > 100 Тогда 
			
			ТекстСообщения = "Выявлено превышение скидки 100% в Таблице Товары";
	        ТекстПоля = "Объект.Товары["+(Сч)+"].Скидка";
			
			СообщениеПользователю(ТекстСообщения, ТекстПоля); 
			
			ОбщаяСуммаСкидкиТовары = 100;
           		
		КонецЕсли;
		
		Объект.Товары[Сч].Сумма = Объект.Товары[Сч].Цена * Объект.Товары[Сч].Количество ;
		
		Объект.Товары[Сч].Сумма = Объект.Товары[Сч].Сумма - Объект.Товары[Сч].Сумма / 100 * ОбщаяСуммаСкидкиТовары;
		
		Сч = Сч +1; 
		
	КонецЦикла;
	
	
	Сч = 0;
	
	Пока Сч < Объект.Услуги.Количество() Цикл  // для страницы Услуги
		
		ОбщаяСуммаСкидкиУслуги = Объект.Услуги[Сч].Скидка + Объект.БС_СогласованнаяСкидка; 
		
		Если ОбщаяСуммаСкидкиУслуги > 100 Тогда
			 								
			ТекстСообщения = "Выявлено превышение скидки 100% в Таблице Услуги";
	        ТекстПоля = "Объект.Услуги["+(Сч)+"].Скидка";
			
			СообщениеПользователю(ТекстСообщения, ТекстПоля); 
			
			ОбщаяСуммаСкидкиТовары = 100;
           			
		КонецЕсли;
		
		Объект.Услуги[Сч].Сумма = Объект.Услуги[Сч].Цена * Объект.Услуги[Сч].Количество ;
		
		Объект.Услуги[Сч].Сумма = Объект.Услуги[Сч].Сумма - Объект.Услуги[Сч].Сумма / 100 * ОбщаяСуммаСкидкиУслуги;
		
		Сч = Сч +1;
		
	КонецЦикла;  
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма")// расчет суммы документа
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПользователю(ТекстСообщения, ТекстПоля) Экспорт
	 
	Сообщение = Новый СообщениеПользователю;
	
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Поле = ТекстПоля;
	Сообщение.Сообщить();
		
КонецПроцедуры
 








