&НаКлиенте
Процедура ПриИзмененииСогласованнаяСкидка(Форма) Экспорт 
	
	//    Проверка условия заполненности табличной части и открытой страницы таблицы
	Если (Форма.Элементы.Страницы.ТекущаяСтраница.Заголовок = "Товары"  И Форма.Объект.Товары.Количество() > 0) ИЛИ 
		
		Форма.Элементы.Страницы.ТекущаяСтраница.Заголовок = "Услуги" И Форма.Объект.Услуги.Количество() > 0  Тогда
		
		ДиалогНаРасчетСкидки(Форма);
		
	КонецЕсли;
	   
КонецПроцедуры


&НаКлиенте
Асинх Процедура ДиалогНаРасчетСкидки(Форма)
	
	Обещание = ВопросАсинх("Изменен процент скидки. Пересчитать табличную часть?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
	Результат = Ждать обещание; // тут выполнение остановится пока пользователь не ответит на вопрос
	
	Если Результат = КодВозвратаДиалога.Да Тогда  // если выбрали "ДА"
		
		ПересчетТаблиц(Форма);
		
	Иначе
		
		Возврат;// если выбрали "НЕТ"
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПересчетТаблиц(Форма) Экспорт // расчет скидки для всех элементов в табличной части 
	
	Сч = 0;
	
	Объект = Форма.Объект;
	
	Пока Сч < Объект.Товары.Количество() Цикл  // для страницы ТОВАРЫ
		
		Объект.Товары[Сч].Сумма = Объект.Товары[Сч].Цена * Объект.Товары[Сч].Количество ;
		
		Объект.Товары[Сч].Сумма = Объект.Товары[Сч].Сумма - Объект.Товары[Сч].Сумма / 100 * Объект.БС_СогласованнаяСкидка;
		
		Сч = Сч +1;
		
	КонецЦикла;
	
	Пока Сч < Объект.Услуги.Количество() Цикл  // для страницы Услуги
		
		Объект.Услуги[Сч].Сумма = Объект.Услуги[Сч].Цена * Объект.Услуги[Сч].Количество ;
		
		Объект.Услуги[Сч].Сумма = Объект.Услуги[Сч].Сумма - Объект.Услуги[Сч].Сумма / 100 * Объект.БС_СогласованнаяСкидка;
		
		Сч = Сч +1;
		
	КонецЦикла; 
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма")// расчет суммы документа
	
КонецПроцедуры 








